__author__ = 'Мишин Егор Олегович'
# Задача-1:
# Напишите небольшую консольную утилиту,
# позволяющую работать с папками текущей директории.
# Утилита должна иметь меню выбора действия, в котором будут пункты:
# 1. Перейти в папку
# 2. Просмотреть содержимое текущей папки
# 3. Удалить папку
# 4. Создать папку
# При выборе пунктов 1, 3, 4 программа запрашивает название папки
# и выводит результат действия: "Успешно создано/удалено/перешел",
# "Невозможно создать/удалить/перейти"

def program_ui():
    print('\nДобро пожаловать!\n ---- M E N U ----')
    button = input("\n 1 - Перейти в папку\n 2 - Просмотреть содержимое текущей папки"
                   "\n 3 - Удалить папку\n 4 - Создать папку \n")
    return button

def ifexit():
    pass

button = program_ui()
print(button)
#while ans != 'quit':
    #try

# Для решения данной задачи используйте алгоритмы из задания easy,
# оформленные в виде соответствующих функций,
# и импортированные в данный файл из easy.py
# easy.py как модуль